-- MySQL dump 10.16  Distrib 10.1.48-MariaDB, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: db
-- ------------------------------------------------------
-- Server version	10.1.48-MariaDB-0+deb9u2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `teacher`
--

DROP TABLE IF EXISTS `teacher`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `teacher` (
  `id` smallint(6) DEFAULT NULL,
  `department_id` varchar(2) DEFAULT NULL,
  `first_name` varchar(14) DEFAULT NULL,
  `second_name` varchar(15) DEFAULT NULL,
  `last_name` varchar(17) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `teacher`
--

LOCK TABLES `teacher` WRITE;
/*!40000 ALTER TABLE `teacher` DISABLE KEYS */;
INSERT INTO `teacher` VALUES (1,'1','Зумруд','Абдулагатова','Заидовна'),(2,'1','Анжела','Азизова','Азизовна'),(3,'1','Алина','Алиева','Эльдаровна'),(4,'1','Хаписат','Алижанова','Алижановна'),(5,'1','Залина','Ахмедова','Абдулаевна'),(6,'1','Зайнаб','Бекбулатова','Абдулмуслимовна'),(7,'1','Магомедрасул','Бучаев','Ахмедович'),(8,'1','Зарема','Гасанова','Ахмедовна'),(9,'1','Тамила','Исабекова','Илахидиновна'),(10,'1','Рамазан','Кадиев','Исмаилович'),(11,'1','Дмитрий','Кобзаренко','Николаевич'),(12,'1','Нурулла','Кулибеков','Асадуллаевич'),(13,'1','Динара','Магомедова','Сахратулаевна'),(14,'1','Мадина','Магомедова','Гаджимурадовна'),(15,'1','Заур','Меджидов','Уруджалиевич'),(16,'1','Муртузали','Муртазалиев','Магомедович'),(17,'1','Марьям','Муртузалиева','Курбановна'),(18,'1','Арслан','Мустафаев','Гасанович'),(19,'1','Карахан','Раджабов','Якубович'),(20,'1','Сабина','Савзиханова','Эминовна'),(21,'1','Елена','Савина','Владимировна'),(22,'1','Магомед','Сурхаев','Абдулаевич'),(23,'1','Минхажидин','Тагиев','Хейрудинович'),(24,'1','Нигара','Эминова','Эминовна'),(25,'1','Эльдар','Эмирбеков','Меликович'),(26,'2','Айна','Адиева','Ахмедовна'),(27,'2','Румина','Адамова','Абдурахмановна'),(28,'2','Эльвира','Анаслаева','Саидовна'),(29,'2','Каис','Гусейнов','Магомедович'),(30,'2','Светлана','Джамалова','Аличубановна'),(31,'2','Рафаэль','Джалалов','Казиханович'),(32,'2','Виктория','Желновакова','Анатольевна'),(33,'2','Халимат','Инусова','Магомедовна'),(34,'2','Анна','Казанбекова','Абакаровна'),(35,'2','Руслан','Келибханов','Келибханович'),(36,'2','Магомедзапир','Магомедов','Рабаданович'),(37,'2','Рустам','Магомедов','Вагидович'),(38,'2','Марина','Меджидова','Гудовна'),(39,'2','Жарият','Мурлиева','Хаджиевна'),(40,'2','Магомед','Омаров','Мангуевич'),(41,'2','Рахмат','Тагирова','Джамалутдиновна'),(42,'2','Эльмира','Сайдиева','Арсеновна'),(43,'2','Юлдуз','Умарова','Абдулкадировна'),(44,'2','Малик','Фаталиев','Бедалович'),(45,'2','Аида','Халимбекова','Муртузалиевна'),(46,'2','Патимат','Хизриева','Ахмедовна'),(47,'2','Наида','Шамхалова','Курбановна'),(48,'2','Любовь','Пронина','Владимировна'),(49,'2','Зарема','Хабибулаева','Фейтиевна'),(50,'2','Эльмар','Бабаев','Асадович'),(51,'2','Гульзар','Гаджиева','Ахмедовна'),(52,'2','Асият','Исмаилова','Махсудовна'),(53,'2','Саидат','Курбанова','Нурмагомедовна'),(54,'2','Аида','Магомедова','Ибрагимовна'),(55,'2','Дина','Султанова','Юсуповна'),(56,'2','Убайдула','Максудов','Абдурахманович'),(57,'3','Диана','Абдулгамидова','Абдулгамидовна'),(58,'3','Анжела','Алиева','Булатгаджиевна'),(59,'3','Якут','Вайлантматова','Забитовна'),(60,'3','Карина','Ибрагимова','Абдурахмановна'),(61,'3','Асият','Ибрагимова','Шамсудиновна'),(62,'3','Зарема','Маллева','Алиевна'),(63,'3','Магомед','Мусалов','Абдуллаевич'),(64,'3','Шарапутдин','Рашидов','Макашарипович'),(65,'3','Марина','Султанова','Арслановна'),(66,'3','Роза','Халилова','Мирзагасановна'),(67,'3','Анжела','Халифаева','Курбановна'),(68,'3','Халимат','Гаджиева','Иманшапиевна'),(69,'3','Аймесей','Дибирова','Ильясовна'),(70,'3','Марат','Зейналов','Магомедович'),(71,'3','Магомед','Магомедов','Чеэрасухмаевич'),(72,'3','Жарият','Раджабова','Курбановна'),(73,'3','Камиль','Шарипов','Магомедович'),(74,'4','Анжела','Абдуллабекова','Эльмирзаевна'),(75,'4','Лейла','Абдулмуслимова','Гусейновна'),(76,'4','Мейрам','Абукарова','Узеровна'),(77,'4','Пасихат','Азизова','Магомедовна'),(78,'4','Асият','Биярсланова','Магомедовна'),(79,'4','Даци','Гаджиев','Магомедович'),(80,'4','Айша','Гаджиева','Ансаровна'),(81,'4','Аида','Далгатова','Османгаджиевна'),(82,'4','Хасбика','Дибирова','Нурмагомедовна'),(83,'4','Манарша','Заидова','Усмахановна'),(84,'4','Салтанат','Зайнулабидова','Магомедовна'),(85,'4','Рустам','Ибаев','Камилович'),(86,'4','Ханича','Ибрагимова','Алибуттаевна'),(87,'4','Диана','Керимханова','Саидовна'),(88,'4','Диана','Курбанова','Нурмагомедовна'),(89,'4','Анвар','Магомедов','Шамильевич'),(90,'4','Ахмед','Магомедов','Ахмедович'),(91,'4','Рисалат','Магомедова','Магдибеговна'),(92,'4','Марьяна','Махмудова','Амруллаховна'),(93,'4','Асма','Мусаева','Гаджиевна'),(94,'4','Рена','Пирова','Низамиевна'),(95,'4','Рашид','Ханмурзаев','Багавдинович'),(96,'4','Хадижат','Шахбанова','Магомедовна'),(97,'4','Калимулла','Шахманаев','Абдулмуслимович'),(98,'5','Ашура','Абасова','Магомедтагировна'),(99,'5','Абдулла','Абдуллаев','Рафикович'),(101,'5','Элифхан','Агаханов','Керимханович'),(102,'5','Дагмара','Айламматова','Айламматовна');
/*!40000 ALTER TABLE `teacher` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-04-30 16:42:40
